// ----- СИСТЕМНЕ ЯДРО ----- // 
#include "config.h" // Підключаєм піни 
#include "system.h" // Підключаєм общи файли

// ----- API key, CX ----- //
const char* apiKey = "AIzaSy...";   // ключ API
const char* cx = "abcd123:xyz";     // ідентифікатор CSE



// ----- Створюєс об'єкти ----- //
Preferences prefs;                           // Створюєм об'єкт для EPRROM пам'яті
GyverOLED<SSD1306_128x64, OLED_BUFFER> oled; // Створюєм об'єкт для дисплею
File file;                                   // Створюєм об'єкт для роботи з файлами SD карти


// ----- Зміна для читання програм на SD ----- //
const char* firmwarePath = "/apps/app.bin"; // /apps - наша папка у якій знаходяться усі програми
                                            // /app.bin - тут вказуєм програму яку треба завантажити
const char* system_OS = "/system/os.bin";   // /system - пакпка з операційною системою
                                            // /os.bin - файл в якому записана операційна система
const char* system_version = "/system/os_version.txt"; // /system/os_version.txt - Файл у якому зберігається версія прошивки
const char* notes_txt = "/apps/notes";      // /apps/notes - шлях до файлів txt нотатки
uint8_t buffer[BUFFER_SIZE];                // У цей масив тим часово записуются считані файли з SD
// ----- Створюєм масив у якому будуть всі назви програм ----- //
const char* program_list[] = {
    // ===== 🧩 Системні програми =====
  "Settings",
  "Wi-Fi Manager",
  "Clock",
  "File Explorer",
  "System Info",
  "Updater",

  // ===== ⚙️ Корисні утиліти =====
  "Calculator",
  "Notes",
  "Paint",
  "Gallery",
  "Music Player",
  "Terminal",
  "Broswer",

  // ===== 🎮 Ігри =====
  "Snake",
  "Tetris",
  "2048",
  "Doom Mini",
  "Flappy Bird",
  "Pong"
};
int visibleItems = 8;  // створюємо зміну  для того щоб знати скільки виводити пунктів на дисплей
int current = 0;       // номер обраного пункту/вказівний для курсору
const int program_items = sizeof(program_list) / sizeof(program_list[0]);


// ----- Зміні для відслідковування кординат букв ----- //
int char_x = 0;
int char_y = 0;


// ----- Створення об'єктів для роботи с кнопками ----- //
GButton but_left(button_LEFT);   // Підключаєм кнопку LEFT
GButton but_right(button_RIGHT); // Підключаєм кнопку RIGHT
GButton but_up(button_UP);       // Підключаєм кнопку UP
GButton but_down(button_DOWN);   // Підключаєм кнопку DOWN
GButton but_ok(button_OK);       // Підключаєм кнопку OK



// ----- Створення таймерів ----- //
unsigned long time_button;         // тай мер для кнопок (Лише для одиночного натискання)
unsigned long time_menu_scrol;     // Таймер для скролу меню
unsigned long time_oled;           // Таймер для дисплея
unsigned long time_delay;
unsigned long time_text;           // Таймер для відображення даного знаку: "_" в моргаючому стані 

int time_react = 90;         // Швидкісь=ть обробки натискань кнопок (Лише для одиночного натискання)
int time_text_millis = 500;

// ----- Налаштування користувача ----- //
int fontSize = 1;      // розмір шрифту
int brightness = 255;  // яскравість
bool darkMode = false; // тема (на майбутнє)


// ----- Стани Системи ----- //
SystemState state = MENU;  // поточний стан системи при включені



// ----- Зміні для роботи з SD картою ----- //

void setup() {
  // ----- Встановлюєм режими пінів -----//
  pinMode(button_UP, INPUT_PULLUP);
  pinMode(button_DOWN, INPUT_PULLUP);
  pinMode(button_LEFT, INPUT_PULLUP);
  pinMode(button_RIGHT, INPUT_PULLUP);
  pinMode(button_OK, INPUT_PULLUP);

  oled.init();      // інцілізірцєм дисплей
  delay(100);        // Даєм час для інцілізації

  // ----- Налаштування EPRROM ----- //
  prefs.begin("SetingUSER"); // відкриваємо простір якщо такого простору не існує то створюєм

  // ----- Яскравість OLED ----- //
  if (!prefs.isKey("oledContrast")) {   
    prefs.putInt("oledContrast", 255);  
  }

  // ----- Розмір шрифту ----- //
  if (!prefs.isKey("fontSize")) { 
    prefs.putInt("fontSize", 1);  
  }

  // ----- Кількість видимих елементів у меню ----- //
  if (!prefs.isKey("visibleItems")) { 
    prefs.putInt("visibleItems", 8);  
  }

  // ----- Зчитуємо параметри ----- //
  fontSize     = prefs.getInt("fontSize", 1);
  brightness   = prefs.getInt("oledContrast", 255);
  visibleItems = prefs.getInt("visibleItems", 8);
  prefs.end(); // Закриваєм EPRROM
  // ----- Налаштування дисплею ----- //
  oled.setScale(fontSize); 
  oled.setContrast(brightness);


  // ----- Виводим картинку на дисплей текст ----- // 
  oled.clear();     // Чистим дисплей
  oled.update();    // оновлюєм дисплей
  oled.home();      // Ставим курсор на 0 0
  oled.print("loading system..."); // Виводим сповіщення на дисплей
  oled.update();    // обновляєм дисплей
  // ----- ----- //
  Serial.begin(9600); // Інцілізіруєм serial порт
  delay(100);



  // ----- Ініцілізація інших об'яктів ----- //
  SPI.begin(SD_CLK, SD_MISO, SD_MOSI, SD_CS);// Інцілізіруєм SPI з тими пінами які нам потрібні  
  if (!SD.begin(SD_CS)) {                    // Інцілізіруєм SD карту
    Serial.println("❌ Помилка: SD-карту не знайдено або не ініціалізовано!");
    return;
  }
  Serial.println("✅ SD-карту ініціалізовано успішно.");
  delay(100);
  //uint64_t cardSize = SD.cardSize() / (1024 * 1024); // Перевіряєм скільки пам'яті на SD карті та записуєм у зміну
  
  
  // ----- Підключення WiFi ----- //
  prefs.begin("wifi", false);     // Відкриваєм простір wifi у цьому просторі зберігіются паролі та назви вайфай, якщо не існує створюєм

  String savedSsid = prefs.getString("ssid", "");  // прочитати збережений SSID (або "" якщо нема) (SSID - NAME)
  String savedPass = prefs.getString("pass", "");  // прочитати пароль
                                                   // Та записуєм усе у зміні
  prefs.end(); // Закриваєм EPRROM
  if (savedSsid.length()) { // Перевіряєм чи є в пам'яті збережений Ssid якщо є то виконуєм код далі
    Serial.println("Спроба автопідключення до: " + savedSsid); // Повідомлення до якої мережі ми підключаємось

    WiFi.mode(WIFI_STA); // Встановлюєм режим роботи WiFi_STA топто клієнтьський режим це коли ESP32 підключається до мережі,
                         // А не створює власну точку доступу
    WiFi.begin(savedSsid.c_str(), savedPass.c_str()); // Зарускаємо підключення до мережі вайфай
    
    unsigned long t0 = millis();

    while (millis() - t0 < 10000) {             // Даємо 10 сек. щоб підключитися до WiFi
      if (WiFi.status() == WL_CONNECTED) break; // Перевіряєм якщо вайфай підключився то виходим з циклу
      delay(100);                               // Чекаємо 100 мілесекунд щоб не перевантажити систему
    }

    if (WiFi.status() == WL_CONNECTED) {
      Serial.println("Мережа успішно підключена");
      return; // Виходимо з setup та починаєм основний цикл
    } else {
      Serial.println("Не вдалось автоматично підключитися до мережі");
      WiFi.disconnect(true); // Розриваєм поточне з'єднання якщо воно було, true - забуваєм налаштування драйвера WiFi (Очищає кеш)
      return;
    }




  // ----- Hello User ----- //
  oled.clear();              // Чистим дисплей
  if (visibleItems == 8) {
    oled.setCursor(34, 3);     // Ставим курсор на 34 та на 3 строку по Y
    oled.print("Hello User");  // Виводим сповіщення на дисплей
  } else {
    oled.setCursor(4, 3);     // Ставим курсор на 4 та на 3 строку по Y
    oled.print("Hello User");  // Виводим сповіщення на дисплей
  }
  oled.update();             // оновлюєм дисплей
  delay(2000);


  
  }

}

void loop() {
  // ----- Оновлюєм кнопки ----- //
  but_left.tick();
  but_right.tick();
  but_up.tick();
  but_down.tick();

  // ----- Перевіряєм який зараз стан системи ----- //
  switch (state) {        // ----- Лише стани встроєних програм в систему інші програми записаніи на SD карту ----- // 
    case MENU:                  // ----- Стан системи меню ----- //
    handleButtons();
    drawingOLED();
    break;

    case APP_SETTINGS:          // ----- Стан системи настройки ----- //
    button_setting();
    seting();
    break;

    case APP__WiFiMANAGER:      // ----- Стан системи програма WiFi менеджер ----- //
    button_setting();
    WiFiManager();
    break;

    case APP_CLOCK:             // ----- Стан системи програма годиник ----- //
    button_setting();
    app_clock();
    break;

    case APP_FILEEXPLORER:      // ----- Стан системи програма керування файлами на SD, EPRROM ----- //
    button_setting();
    fileexplorer();
    break;

    case APP_SYSTEMINFO:        // ----- Стан системи програма про стан системи ----- //
    button_setting();
    systemInfo();
    break;

    case APP_UPDATER:           // ----- Стан системи програма оновлення OS ----- //
    button_setting();
    systemUpdate();
    break;

    case APP_CALKULATOR:        // ----- Стан системи програма калькулятор ----- //
    break;

    case APP_NOTES:             // ----- Стан системи програма нотатки ----- //
    button_setting();
    notes();
    break;

    case APP_TERMINAL:          // ----- Стан системи програма термінал для управління усім ----- //
    terminal_button();
    terminal();
    break;

    case APP_BROSWER:           // ----- Стан системи програма браузер для запитів в Google ----- //
    button_setting();
    broswer();
    break;
  }


}



// ----- Функція для обробки натискань кнопок ----- //
void handleButtons() {

  if (millis() - time_button > time_react) { // ----- перевіряєм таймер ----- //
    time_button = millis();
    // ----- КНОПКА UP ----- //
    if (digitalRead(button_UP) == LOW) {
      if (current != 0) {
        current--;
      } else {
        current = program_items - 1;
      }
    }
    // ----- КНОПКА DOWN ----- //
    if (digitalRead(button_DOWN) == LOW) {
      if (current < program_items - 1) {
        current++;
      } else {
        current = 0;
      }
    }
    // ----- КНОПКА OK ----- //
    if (digitalRead(button_OK) == LOW) {
      openProgram(current);
    }
  }

  
}
 


// ----- Функція для виводу зображення на дисплей ----- //
void drawingOLED() {

  if (millis() - time_oled > 30) {
    time_oled = millis();
    oled.clear();
    int page = current / visibleItems; // Визначаєжм яка зараз сторінка 0 - 1 сторінка, 1 - друга
    int start = page * visibleItems;   // Визначаєм з якого елементу почати виводити масив
    int end = start + visibleItems;    // Визначаєм до якого останього елементу виводити масив
    for (int i = start; i < end && i < program_items; i++) {
        oled.setCursor(15, (i - start) * fontSize);
        oled.print(program_list[i]);
    }
    oled.setCursor(0, (current - start) * fontSize);
    oled.print(">");





    oled.update();
  
  }
}


// ----- Функція для відкриття програм ----- // 
void openProgram(int index) {
  switch (index) {        // у цій функції ми встановлюємо стан системи або считуєм програму з SD картки та відкриваєм
                          // важливо при виході з системного стану потрібно встановлювати стан MENU
                          // якщо ми считуєм програму з SD то мікроконтролер перепрошивається щоб її відкрити тому у програмах з SD
                          // потрібна функція виходу щоб назад перепрошиватися на SD Щоб це зробити то треба записчати операційец систему теж на
                          // SD карту.
      case 0: state = APP_SETTINGS; break;          // Програма настройки встроєна в OS
      case 1: state = APP__WiFiMANAGER; break;      // Програма налаштування вайфай встроєна в OS
      case 2: state = APP_CLOCK; break;             // Програма часи, таймер встроєна в OS
      case 3: state = APP_FILEEXPLORER; break;      // Програма керування файлами на SD карти встроєна в OS
      case 4: state = APP_SYSTEMINFO; break;        // Програма для перегляду системних характеристик та налаштувань встроєна в OS
      case 5: state = APP_UPDATER; break;           // Програма для оновлення системи через WiFi встроєна в OS
      case 6: state = APP_CALKULATOR; break;        // Програма калькулятор встроєна в OS
      case 7: state = APP_NOTES; break;             // Програма нотатки встроена в OS
      case 8: firmwarePath = "/apps/Paint.bin"; loading_SD_program(); break;      // Paint" Не встроена в OS завантаження через SD 
      case 9: firmwarePath = "/apps/Gallery.bin"; loading_SD_program(); break;    // Gallery Не встроена в OS завантаження через SD
      case 10: firmwarePath = "/apps/Music.bin"; loading_SD_program(); break;     // Music Player Не встроена в OS завантаження через SD
      case 11: state = APP_TERMINAL; break;         // Програма для управління OS встроєна в OS
      case 12: state = APP_BROSWER; break;          // Програма пошуку в системах гугл 2 версії встроена в OS та записана на SD
      case 13: firmwarePath = "/apps/Snake.bin"; loading_SD_program(); break;     // Snake Не встроена в OS завантаження через SD
      case 14: firmwarePath = "/apps/Tetris.bin"; loading_SD_program(); break;    // Tetris Не встроена в OS завантаження через SD
      case 15: firmwarePath = "/apps/2048.bin"; loading_SD_program(); break;      // 2048 Не встроена в OS завантаження через SD
      case 16: firmwarePath = "/apps/DoomMini.bin"; loading_SD_program(); break;  // Doom Mini Не встроена в OS завантаження через SD
      case 17: firmwarePath = "/apps/FlappyBird.bin"; loading_SD_program(); break;// Flappy Bird Не встроена в OS завантаження через SD
      case 18: firmwarePath = "/apps/pong.bin"; loading_SD_program(); break;      // Pong Не встроена в OS завантаження через SD
  }
}












// ----- ЗАМЕТКИ С КОМАНДАМИ ТА ПРИКЛАДАМИ КОДУ ----- // 
  // file = SD.open("/test.txt", FILE_WRITE); // Відкриваєм файл на SD карті /test.txt якщо такого файлу нема то створюєм у корені SD
  // if (file) {  // Працюєм с файлом
  //   file.println("Hello ESP32 mini OS"); // записуєм у файл test.txt текст
  //   file.println("Привіт");
  //   file.close(); // Закриваєм файл щоб дані зберіглися
  // }

  // file = SD.open("/test.txt"); // Відкриваєм файл у режимі читання
  // if (file) {
  //   while (file.available()) { // Цикл не закінчится поки є дані у файлі
  //     Serial.write(file.read());
  //   }
  //   file.close();
  // }

  // if (!SD.exists("/data")) { // Перевіряєм чи існує папка data 
  //   SD.mkdir("/data");       // Якщо такої папки не існує то створюєм її 
  //   Serial.println("Winerr");
  // }
  // SD.rmdir("/data");         // Видалити папку/теку/файл  